sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_uart.c
/*!
    \file    gd32a7xx_linflexd_uart.c
    \brief   LINFlexD_UART driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/
#include "gd32a7xx_linflexd_uart.h"

#define DEFAULT_BAUDRATE            115200U                /* default baud rate value */
#define DEFAULT_OSR                 16U                    /* the OSR value of default */
#define BAUDRATE_FRACTION_WIDTH     4U                     /* the fraction baudrate width */
#define LINFLEXD_UART_DELAY         0x8FFFFU               /* infinite loop delay count */

/*!
    \brief      reset LINFlexD_UART (API_ID(0x0001U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
ErrStatus linflexd_uart_deinit(uint32_t linflexd_uart_periph)
{
    ErrStatus reval = SUCCESS;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0001U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t timeout_cnt;
        /* enter initialization mode */
        linflexd_uart_initmode_enter(linflexd_uart_periph);
        /* load delay count */
        timeout_cnt = LINFLEXD_UART_DELAY;
        while ((linflexd_uart_state_get(linflexd_uart_periph) != LINFLEXD_UART_STATE_INIT_MODE)  && (0U != timeout_cnt)) {
            timeout_cnt--;
        }
        
        if(linflexd_uart_state_get(linflexd_uart_periph) != LINFLEXD_UART_STATE_INIT_MODE){
            /* set error status */
            reval = ERROR;
        } else {
            /* reset LINFlexD_UART register */
            LINFLEXD_UART_LINIER(linflexd_uart_periph)      = 0x00000000U;
            LINFLEXD_UART_LINSR(linflexd_uart_periph)       = 0x00080327U;
            LINFLEXD_UART_LINESR(linflexd_uart_periph)      = 0x0000FF81U;
            LINFLEXD_UART_UARTCR(linflexd_uart_periph)      = 0x00000000U;
            LINFLEXD_UART_UARTSR(linflexd_uart_periph)      = 0x0000C7AFU;
            LINFLEXD_UART_LINTCSR(linflexd_uart_periph)     = 0x00000200U;
            LINFLEXD_UART_LINOCR(linflexd_uart_periph)      = 0x0000FFFFU;
            LINFLEXD_UART_LINTOCR(linflexd_uart_periph)     = 0x00000E2CU;
            LINFLEXD_UART_LINFBRR(linflexd_uart_periph)     = 0x00000000U;
            LINFLEXD_UART_LINIBRR(linflexd_uart_periph)     = 0x00000000U;
            LINFLEXD_UART_LINCFR(linflexd_uart_periph)      = 0x00000000U;
            LINFLEXD_UART_LINCR2(linflexd_uart_periph)      = 0x00006000U;
            LINFLEXD_UART_BIDR(linflexd_uart_periph)        = 0x00000000U;
            LINFLEXD_UART_BDRL(linflexd_uart_periph)        = 0x00000000U;
            LINFLEXD_UART_BDRM(linflexd_uart_periph)        = 0x00000000U;
            LINFLEXD_UART_IFER(linflexd_uart_periph)        = 0x00000000U;
            LINFLEXD_UART_IFMR(linflexd_uart_periph)        = 0x00000000U;
            for(uint32_t i=0U;i<=15U;i++){
                LINFLEXD_UART_IFCR(linflexd_uart_periph, i) = 0x00000000U;
            }
            LINFLEXD_UART_GCR(linflexd_uart_periph)         = 0x00000000U;
            LINFLEXD_UART_UARTPTO(linflexd_uart_periph)     = 0x00000FFFU;
            LINFLEXD_UART_DMATXE(linflexd_uart_periph)      = 0x00000000U;
            LINFLEXD_UART_DMARXE(linflexd_uart_periph)      = 0x00000000U;
            LINFLEXD_UART_LIN_STCTL(linflexd_uart_periph)   = 0x00000000U;
            LINFLEXD_UART_LINCR1(linflexd_uart_periph)      = 0x00000081U;
            LINFLEXD_UART_LINCR1(linflexd_uart_periph)      = 0x00000082U;

            switch(linflexd_uart_periph) {
            case LINFLEXD_UART0:
                /* reset LINFLEXD_UART0 */
                rcu_periph_reset_enable(RCU_LINFLEXD0RST);
                rcu_periph_reset_disable(RCU_LINFLEXD0RST);
                break;
            case LINFLEXD_UART1:
                /* reset LINFLEXD_UART1 */
                rcu_periph_reset_enable(RCU_LINFLEXD1RST);
                rcu_periph_reset_disable(RCU_LINFLEXD1RST);
                break;
            case LINFLEXD_UART2:
                /* reset LINFLEXD_UART2 */
                rcu_periph_reset_enable(RCU_LINFLEXD2RST);
                rcu_periph_reset_disable(RCU_LINFLEXD2RST);
                break;
            case LINFLEXD_UART3:
                /* reset LINFLEXD_UART3 */
                rcu_periph_reset_enable(RCU_LINFLEXD3RST);
                rcu_periph_reset_disable(RCU_LINFLEXD3RST);
                break;
            case LINFLEXD_UART4:
                /* reset LINFLEXD_UART4 */
                rcu_periph_reset_enable(RCU_LINFLEXD4RST);
                rcu_periph_reset_disable(RCU_LINFLEXD4RST);
                break;
            case LINFLEXD_UART5:
                /* reset LINFLEXD_UART5 */
                rcu_periph_reset_enable(RCU_LINFLEXD5RST);
                rcu_periph_reset_disable(RCU_LINFLEXD5RST);
                break;
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
            case LINFLEXD_UART6:
                /* reset LINFLEXD_UART6 */
                rcu_periph_reset_enable(RCU_LINFLEXD6RST);
                rcu_periph_reset_disable(RCU_LINFLEXD6RST);
                break;
            case LINFLEXD_UART7:
                /* reset LINFLEXD_UART7 */
                rcu_periph_reset_enable(RCU_LINFLEXD7RST);
                rcu_periph_reset_disable(RCU_LINFLEXD7RST);
                break;
            case LINFLEXD_UART8:
                /* reset LINFLEXD_UART8 */
                rcu_periph_reset_enable(RCU_LINFLEXD8RST);
                rcu_periph_reset_disable(RCU_LINFLEXD8RST);
                break;
            case LINFLEXD_UART9:
                /* reset LINFLEXD_UART9 */
                rcu_periph_reset_enable(RCU_LINFLEXD9RST);
                rcu_periph_reset_disable(RCU_LINFLEXD9RST);
                break;
            case LINFLEXD_UART10:
                /* reset LINFLEXD_UART10 */
                rcu_periph_reset_enable(RCU_LINFLEXD10RST);
                rcu_periph_reset_disable(RCU_LINFLEXD10RST);
                break;
            case LINFLEXD_UART11:
                /* reset LINFLEXD_UART11 */
                rcu_periph_reset_enable(RCU_LINFLEXD11RST);
                rcu_periph_reset_disable(RCU_LINFLEXD11RST);
                break;
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
            default:
                break;
            }
        }
    }
    return reval;
}

/*!
    \brief      initialize the parameters of LINFlexD_UART struct with default values (API_ID(0x0002U))
    \param[in]  linflexd_uart_struct: pointer to a linflexd_uart_parameter_struct structure, which contains 
                                    the configuration information for the specified LINFlexD_UART peripheral, 
                                    and the member values are shown as below:
                baudrate:       baud rate
                parityenable:   parity control - ENABLE/DISABLE
                paritytype:     always 0/always 1/even/odd
                stopbitscount:  number of stop bits, 1 stop bit/2 stop bits/3 stop bits (only for receiver)
                wordlength:     number of bits per transmitted/received word
                txmodetype:     type of LINFlexD_UART tx transfer (buffer/fifo)
                rxmodetype:     type of LINFlexD_UART rx transfer (buffer/fifo)
    \param[out] none
    \retval     none
*/
void linflexd_uart_struct_para_init(linflexd_uart_parameter_struct *linflexd_uart_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(linflexd_uart_struct)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* configure the structure with default value */
        linflexd_uart_struct->baudrate = DEFAULT_BAUDRATE;
        linflexd_uart_struct->parityenable = DISABLE;
        linflexd_uart_struct->stopbitscount = LINFLEXD_UART_ONE_STOP_BIT;
        linflexd_uart_struct->wordlength = LINFLEXD_UART_8_BITS;
        linflexd_uart_struct->txmodetype = LINFLEXD_UART_TXRX_BUFFER_MODE;
        linflexd_uart_struct->rxmodetype = LINFLEXD_UART_TXRX_BUFFER_MODE;
    }
}

/*!
    \brief      initialize LINFlexD_UART parameter (API_ID(0x0003U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  linflexd_uart_struct: pointer to a linflexd_uart_parameter_struct structure, which contains 
                                    the configuration information for the specified LINFlexD_UART peripheral, 
                                    and the member values are shown as below:
                baudrate:       baud rate
                parityenable:   parity control - ENABLE/DISABLE
                paritytype:     always 0/always 1/even/odd
                stopbitscount:  number of stop bits, 1 stop bit/2 stop bits/3 stop bits (only for receiver)
                wordlength:     number of bits per transmitted/received word
                txmodetype:     type of LINFlexD_UART tx transfer (buffer/fifo)
                rxmodetype:     type of LINFlexD_UART rx transfer (buffer/fifo)
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
ErrStatus linflexd_uart_init(uint32_t linflexd_uart_periph, linflexd_uart_parameter_struct *linflexd_uart_struct)
{
    ErrStatus reval = SUCCESS;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0003U), ERR_PERIPH);
    } else if(NOT_VALID_POINTER(linflexd_uart_struct)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else if(NOT_LINFLEXD_UART_BAUDRATE(linflexd_uart_struct->baudrate)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0003U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        uint32_t timeout_cnt;
        /* enter initialization mode */
        linflexd_uart_initmode_enter(linflexd_uart_periph);
        /* load delay count */
        timeout_cnt = LINFLEXD_UART_DELAY;
        while ((linflexd_uart_state_get(linflexd_uart_periph) != LINFLEXD_UART_STATE_INIT_MODE)  && (0U != timeout_cnt)) {
            timeout_cnt--;
        }
        
        if(linflexd_uart_state_get(linflexd_uart_periph) != LINFLEXD_UART_STATE_INIT_MODE){
            /* set error status */
            reval = ERROR;
        } else {
            /* set LINFlexD_UART mode */
            linflexd_uart_mode_set(linflexd_uart_periph, LINFLEXD_UART_MODE);

            /* set baudrate */
            reval = linflexd_uart_baudrate_set(linflexd_uart_periph, linflexd_uart_struct->baudrate);

            /* set LINFlexD_UART word length */
            linflexd_uart_wordlength_set(linflexd_uart_periph, linflexd_uart_struct->wordlength);
            linflexd_uart_txdatafieldlength_set(linflexd_uart_periph, (uint8_t)((uint8_t)linflexd_uart_struct->wordlength >> 1U));
            linflexd_uart_rxdatafieldlength_set(linflexd_uart_periph, (uint8_t)((uint8_t)linflexd_uart_struct->wordlength >> 1U));

            if(DISABLE == linflexd_uart_struct->parityenable){
                /* disable parity control */
                linflexd_uart_paritycontrol_disable(linflexd_uart_periph);
            } else {
                /* enable and set parity control */
                linflexd_uart_paritycontrol_enable(linflexd_uart_periph);
                linflexd_uart_paritytype_set(linflexd_uart_periph, linflexd_uart_struct->paritytype);
            }
            /* set stop bits count */
            linflexd_uart_rxstopbitscount_set(linflexd_uart_periph, linflexd_uart_struct->stopbitscount);
            linflexd_uart_txstopbitscount_set(linflexd_uart_periph, linflexd_uart_struct->stopbitscount);

            /* enable FIFO mode for DMA communication, or buffer mode for other communication */
            linflexd_uart_txmode_set(linflexd_uart_periph, linflexd_uart_struct->txmodetype);
            linflexd_uart_rxmode_set(linflexd_uart_periph, linflexd_uart_struct->rxmodetype);

            /* enter normal mode */
            linflexd_uart_normalmode_enter(linflexd_uart_periph);
        }
    }
    return reval;
}

/*!
    \brief      LINFlexD_UART enter init mode (API_ID(0x0004U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_initmode_enter(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0004U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

