sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_uart.c
        reg = LINFLEXD_UART_LINCR1(linflexd_uart_periph);
        /* exit sleep mode */
        reg &= ~(LINFLEXD_UART_LINCR1_SLEEP);
        /* enter init mode */
        reg |= LINFLEXD_UART_LINCR1_INIT;
        LINFLEXD_UART_LINCR1(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      LINFlexD_UART enter normal mode (API_ID(0x0005U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_normalmode_enter(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0005U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_LINCR1(linflexd_uart_periph);
        /* exit sleep mode */
        reg &= ~(LINFLEXD_UART_LINCR1_SLEEP);
        /* exit init mode */
        reg &= ~(LINFLEXD_UART_LINCR1_INIT);
        LINFLEXD_UART_LINCR1(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      enable LINFlexD_UART sleep mode (API_ID(0x0006U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_sleepmode_enable(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0006U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_LINCR1(linflexd_uart_periph);
        /* enter sleep mode */
        reg |= LINFLEXD_UART_LINCR1_SLEEP;
        LINFLEXD_UART_LINCR1(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      disable LINFlexD_UART sleep mode (API_ID(0x0007U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_sleepmode_disable(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0007U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_LINCR1(linflexd_uart_periph);
        /* exit sleep mode */
        reg &= ~LINFLEXD_UART_LINCR1_SLEEP;
        LINFLEXD_UART_LINCR1(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      get LINFlexD_UART sleep mode (API_ID(0x0008U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     sleepmode: RESET, sleep mode disabled; SET, sleep mode enabled
*/
FlagStatus linflexd_uart_sleepmode_get(uint32_t linflexd_uart_periph)
{
    FlagStatus sleepmode = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0008U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_LINCR1(linflexd_uart_periph);
        /* check sleep mode bit */
        sleepmode = ((reg & LINFLEXD_UART_LINCR1_SLEEP) != 0x0U) ? SET : RESET;
    }
    return sleepmode;
}

/*!
    \brief      enable LINFlexD_UART receiver buffer locked mode (API_ID(0x0009U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_receiverbufferlocked_enable(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0009U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_LINCR1(linflexd_uart_periph);
        /* enter receiver buffer locked mode */
        reg |= LINFLEXD_UART_LINCR1_RBLM;
        LINFLEXD_UART_LINCR1(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      disable LINFlexD_UART receiver buffer locked mode (API_ID(0x000AU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_receiverbufferlocked_disable(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x000AU), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_LINCR1(linflexd_uart_periph);
        /* exit receiver buffer locked mode */
        reg &= ~LINFLEXD_UART_LINCR1_RBLM;
        LINFLEXD_UART_LINCR1(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      enable LINFlexD_UART loopback mode (API_ID(0x000BU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_loopback_enable(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x000BU), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_LINCR1(linflexd_uart_periph);
        /* enter loopback mode */
        reg |= LINFLEXD_UART_LINCR1_LBKM;
        LINFLEXD_UART_LINCR1(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      disable LINFlexD_UART loopback mode (API_ID(0x000CU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_loopback_disable(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x000CU), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_LINCR1(linflexd_uart_periph);
        /* exit loopback mode */
        reg &= ~LINFLEXD_UART_LINCR1_LBKM;
        LINFLEXD_UART_LINCR1(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      config LINFlexD_UART auto wakeup hardware to clear the SLEEP bit (API_ID(0x000DU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_autowake_hw_clear(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x000DU), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

