sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_uart.c
        reg = LINFLEXD_UART_LINCR1(linflexd_uart_periph);
        /* set hardware clear SLEEP bit */
        reg |= LINFLEXD_UART_LINCR1_AUTOWU;
        LINFLEXD_UART_LINCR1(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      config LINFlexD_UART auto wakeup software to clear the SLEEP bit (API_ID(0x000EU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_autowake_sw_clear(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x000EU), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_LINCR1(linflexd_uart_periph);
        /* set software clear SLEEP bit */
        reg &= ~LINFLEXD_UART_LINCR1_AUTOWU;
        LINFLEXD_UART_LINCR1(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      LINFlexD_UART integer baudrate set (API_ID(0x000FU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  ibr: integer baud rate
    \param[out] none
    \retval     none
*/
void linflexd_uart_integer_baudrate_set(uint32_t linflexd_uart_periph, uint32_t ibr)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x000FU), ERR_PERIPH);
    } else if(NOT_LINFLEXD_UART_IBR(ibr)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x000FU), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_LINIBRR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_LINIBRR_IBR);
        /* set integer baud rate */
        reg |= ibr;
        LINFLEXD_UART_LINIBRR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      LINFlexD_UART fractional baudrate set (API_ID(0x0010U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  fbr: fractional baud rate
    \param[out] none
    \retval     none
*/
void linflexd_uart_fractional_baudrate_set(uint32_t linflexd_uart_periph, uint8_t fbr)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0010U), ERR_PERIPH);
    } else if(NOT_LINFLEXD_UART_FBR(fbr)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0010U), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_LINFBRR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_LINFBRR_FBR);
        reg |= fbr;
        LINFLEXD_UART_LINFBRR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      configure LINFlexD_UART baudrate value (API_ID(0x0011U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  baudval: baudrate value
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
ErrStatus linflexd_uart_baudrate_set(uint32_t linflexd_uart_periph, uint32_t baudval)
{
    ErrStatus reval = SUCCESS;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0011U), ERR_PERIPH);
    } else if(NOT_LINFLEXD_UART_BAUDRATE(baudval)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0011U), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t uclk;
        float prescaler;
        float fraction;
        uint32_t mantissa;
        uint32_t fractionDenominator;
        uint8_t fractionNumerator;
        uint32_t timeout_cnt;
        FlagStatus initstatus = RESET;

        /* get the clock frequency of LINFLEXD_UART */
        uclk = rcu_clock_freq_get(CK_LINFLEXD); 

        /* compute the values for baudrate divider mantissa and fraction */
        prescaler = (float)uclk / ((float)baudval * (float)DEFAULT_OSR);
        mantissa = (uint32_t)prescaler;
        fraction = prescaler - (float)mantissa;
        fractionDenominator = ((uint32_t)1U << (uint32_t)BAUDRATE_FRACTION_WIDTH);
        float floatNumerator = ((float)fraction * (float)fractionDenominator) + (float)0.5F;
        fractionNumerator = (uint8_t)(floatNumerator);

        if(fractionNumerator == fractionDenominator)
        {
            fractionNumerator = 0U;
            mantissa++;
        }

        if(linflexd_uart_state_get(linflexd_uart_periph) != LINFLEXD_UART_STATE_INIT_MODE)
        {
            /* request init mode and wait until the mode entry is complete */
            linflexd_uart_initmode_enter(linflexd_uart_periph);
            /* load delay count */
            timeout_cnt = LINFLEXD_UART_DELAY;
            while ((linflexd_uart_state_get(linflexd_uart_periph) != LINFLEXD_UART_STATE_INIT_MODE) && (0U != timeout_cnt)) {
                timeout_cnt--;
            }
            
            if(linflexd_uart_state_get(linflexd_uart_periph) == LINFLEXD_UART_STATE_INIT_MODE) {
                /* record init status */
                initstatus = SET;
            } else {
                /* record init status */
                initstatus = RESET;
                /* timeout, record the error status */
                reval = ERROR;
            }
        }
        
        /* write the computed values to registers */
        linflexd_uart_integer_baudrate_set(linflexd_uart_periph, mantissa);
        linflexd_uart_fractional_baudrate_set(linflexd_uart_periph, fractionNumerator);

        if(SET == initstatus)
        {
            /* enter normal mode */
            linflexd_uart_normalmode_enter(linflexd_uart_periph);
        }
    }
    return reval;
}

/*!
    \brief      LINFlexD_UART mode (LIN/UART) set (API_ID(0x0012U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  mode: LINFlexD mode - LINFLEXD_LIN_MODE/LINFLEXD_UART_MODE
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_LIN_MODE: LIN mode
      \arg        LINFLEXD_UART_MODE: UART mode
    \param[out] none
    \retval     none
*/
void linflexd_uart_mode_set(uint32_t linflexd_uart_periph, linflexd_uart_mode_enum mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0012U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

