sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_uart.c
        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_UARTCR_UART);
        /* set LINFlexD_UART mode */
        reg |= (uint32_t)mode;
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      LINFlexD_UART current state get (API_ID(0x0013U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     state: current LINFlexD state
*/
linflexd_uart_state_enum linflexd_uart_state_get(uint32_t linflexd_uart_periph)
{
    linflexd_uart_state_enum state = LINFLEXD_UART_STATE_SLEEP_MODE;
    
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0013U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;
        uint32_t val;

        reg = LINFLEXD_UART_LINSR(linflexd_uart_periph);
        val = (reg & LINFLEXD_UART_LINSR_LINS) >> 12U;
        /* get LINFlexD_UART state */
        state = (linflexd_uart_state_enum)val;
    }
    return state;
}

/*!
    \brief      LINFlexD_UART word length set (API_ID(0x0014U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  length: the word length
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_7_BITS: 7 bits
      \arg        LINFLEXD_UART_8_BITS: 8 bits
      \arg        LINFLEXD_UART_15_BITS: 15 bits
      \arg        LINFLEXD_UART_16_BITS: 16 bits
    \param[out] none
    \retval     none
*/
void linflexd_uart_wordlength_set(uint32_t linflexd_uart_periph, linflexd_uart_word_length_enum length)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0014U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        /* set word length WL0 */
        reg &= ~(LINFLEXD_UART_UARTCR_WL0);
        reg |= ((uint32_t)length & 1U) << 1U;
        /* set word length WL1 */
        reg &= ~(LINFLEXD_UART_UARTCR_WL1);
        reg |= (((uint32_t)length >> 1U) & 1U) << 7U;
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      get LINFlexD_UART word length (API_ID(0x0015U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     length: the word length
*/
linflexd_uart_word_length_enum linflexd_uart_wordlength_get(uint32_t linflexd_uart_periph)
{
    linflexd_uart_word_length_enum wordlength = LINFLEXD_UART_7_BITS;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0015U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;
        uint8_t wl0;
        uint8_t wl1;
        
        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        /* extract WL0 (right shift 1 bit: low bit) */
        wl0 = (uint8_t)((reg & LINFLEXD_UART_UARTCR_WL0) >> 1U);
        /* extract WL1 (right shift 7 bit: high bit) */
        wl1 = (uint8_t)((reg & LINFLEXD_UART_UARTCR_WL1) >> 7U);
        /* get word length */
        if((0U == wl1) && (0U == wl0)){
            wordlength = LINFLEXD_UART_7_BITS;
        } else if((0U == wl1) && (1U == wl0)){
            wordlength = LINFLEXD_UART_8_BITS;
        } else if((1U == wl1) && (0U == wl0)){
            wordlength = LINFLEXD_UART_15_BITS;
        } else if((1U == wl1) && (1U == wl0)){
            wordlength = LINFLEXD_UART_16_BITS;
        } else{
        }
    }
    return wordlength;
}

/*!
    \brief      enable LINFlexD_UART parity bit (API_ID(0x0016U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_paritycontrol_enable(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0016U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        /* enter parity control mode */
        reg |= LINFLEXD_UART_UARTCR_PCE;
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      disable LINFlexD_UART parity bit (API_ID(0x0017U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_paritycontrol_disable(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0017U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        /* exit parity control mode */
        reg &= ~(LINFLEXD_UART_UARTCR_PCE);
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      LINFlexD_UART parity type set (API_ID(0x0018U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  paritytype: the type of parity.(odd/even/always 0/always 1), should be called only when the module is in init mode
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_PARITY_EVEN: even parity
      \arg        LINFLEXD_UART_PARITY_ODD: odd parity
      \arg        LINFLEXD_UART_PARITY_ALWAYS_0: always 0
      \arg        LINFLEXD_UART_PARITY_ALWAYS_1: always 1
    \param[out] none
    \retval     none
*/
void linflexd_uart_paritytype_set(uint32_t linflexd_uart_periph, linflexd_uart_parity_type_enum paritytype)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0018U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        reg |= LINFLEXD_UART_UARTCR_PCE;
        /* set parity control pc0 */
        reg &= ~(LINFLEXD_UART_UARTCR_PC0);
        reg |= ((uint32_t)paritytype & 1U) << 3U;
        /* set parity control pc1 */
        reg &= ~(LINFLEXD_UART_UARTCR_PC1);
        reg |= (((uint32_t)paritytype >> 1U) & 1U) << 6U;
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      configure LINFlexD_UART transmitter (API_ID(0x0019U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  txconfig: enable or disable LINFlexD_UART transmitter
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_TRANSMIT_ENABLE: enable LINFlexD_UART transmission
      \arg        LINFLEXD_UART_TRANSMIT_DISABLE: disable LINFlexD_UART transmission
    \param[out] none
    \retval     none
*/
void linflexd_uart_transmitter_config(uint32_t linflexd_uart_periph, uint32_t txconfig)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0019U), ERR_PERIPH);
    } else if(NOT_LINFLEXD_UART_TRANSMITTER_CONFIG(txconfig)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0019U), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t reg;

