sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_uart.c
        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_UARTCR_TXEN);
        reg |= txconfig;
        /* configure transfer enable */
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      configure LINFlexD_UART receiver (API_ID(0x001AU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  rxconfig: enable or disable LINFlexD_UART receiver
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_RECEIVE_ENABLE: enable LINFlexD_UART reception
      \arg        LINFLEXD_UART_RECEIVE_DISABLE: disable LINFlexD_UART reception
    \param[out] none
    \retval     none
*/
void linflexd_uart_receiver_config(uint32_t linflexd_uart_periph, uint32_t rxconfig)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x001AU), ERR_PERIPH);
    } else if(NOT_LINFLEXD_UART_RECEIVER_CONFIG(rxconfig)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x001AU), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_UARTCR_RXEN);
        reg |= rxconfig;
        /* configure receiver enable */
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      set LINFlexD_UART transmitter mode (FIFO/Buffer) (API_ID(0x001BU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  mode: the mode of transmitter (FIFO/Buffer)
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_TXRX_BUFFER_MODE: buffer mode
      \arg        LINFLEXD_UART_TXRX_FIFO_MODE: FIFO mode
    \param[out] none
    \retval     none
*/
void linflexd_uart_txmode_set(uint32_t linflexd_uart_periph, linflexd_uart_txrx_mode_enum mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x001BU), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_UARTCR_TFBM);
        /* set transmitter mode */
        reg |= (((uint32_t)mode) << 8U);
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      set LINFlexD_UART receiver mode (FIFO/Buffer) (API_ID(0x001CU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  mode: the mode of receiver (FIFO/Buffer)
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_TXRX_BUFFER_MODE: buffer mode
      \arg        LINFLEXD_UART_TXRX_FIFO_MODE: FIFO mode
    \param[out] none
    \retval     none
*/
void linflexd_uart_rxmode_set(uint32_t linflexd_uart_periph, linflexd_uart_txrx_mode_enum mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x001CU), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_UARTCR_RFBM);
        /* set receiver mode */
        reg |= (((uint32_t)mode) << 9U);
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      set LINFlexD_UART receiver data field length (API_ID(0x001DU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  length: data field length/FIFO depth
    \param[out] none
    \retval     none
*/
void linflexd_uart_rxdatafieldlength_set(uint32_t linflexd_uart_periph, uint8_t length)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x001DU), ERR_PERIPH);
    } else if(NOT_LINFLEXD_UART_RXTX_FIELDLENGTH(length)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x001DU), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_UARTCR_RDFL_RFC);
        /* set receiver data field length */
        reg |= ((uint32_t)length << 10U);
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      set LINFlexD_UART transmitter data field length (API_ID(0x001EU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  length: data field length/FIFO depth.
    \param[out] none
    \retval     none
*/
void linflexd_uart_txdatafieldlength_set(uint32_t linflexd_uart_periph, uint8_t length)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x001EU), ERR_PERIPH);
    } else if(NOT_LINFLEXD_UART_RXTX_FIELDLENGTH(length)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x001EU), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_UARTCR_TDFL_TFC);
        reg |= ((uint32_t)length << 13U);
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      flush the data register of LINFlexD_UART receive FIFO (API_ID(0x001FU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_rxfifo_flush(uint32_t linflexd_uart_periph) 
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x001FU), ERR_PERIPH);
    } else
#endif
    {
        volatile const uint8_t *fifoBase;

        /* get the address of the FIFO */
        fifoBase = (volatile const uint8_t *)(&LINFLEXD_UART_BDRM(linflexd_uart_periph));

        /* four dummy reads to flush the FIFO contents - discard the read values */
        (void)(*fifoBase);
        (void)(*fifoBase);
        (void)(*fifoBase);
        (void)(*fifoBase);
    }
}

/*!
    \brief      set LINFlexD_UART number of stop bits for Rx, the stop bits of TX and RX should be kept consistent (API_ID(0x0020U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  stopbitscount: number of stop bits
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_ONE_STOP_BIT: 1 stop bit
      \arg        LINFLEXD_UART_TWO_STOP_BITS: 2 stop bits
      \arg        LINFLEXD_UART_THREE_STOP_BITS: 3 stop bits
    \param[out] none
    \retval     none
*/
void linflexd_uart_rxstopbitscount_set(uint32_t linflexd_uart_periph, linflexd_uart_stop_bits_count_enum stopbitscount)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0020U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

