sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_uart.c
        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_UARTCR_SBUR);
        /* set rx stop bits count */
        reg |= ((uint32_t)stopbitscount << 17U);
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      set LINFlexD_UART number of stop bits for Tx, the stop bits of TX and RX should be kept consistent (API_ID(0x0021U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  stopbitscount: number of stop bits
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_ONE_STOP_BIT: 1 stop bit
      \arg        LINFLEXD_UART_TWO_STOP_BITS: 2 stop bits
    \param[out] none
    \retval     none
*/
void linflexd_uart_txstopbitscount_set(uint32_t linflexd_uart_periph, linflexd_uart_stop_bits_count_enum stopbitscount)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0021U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_GCR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_GCR_STOP);
        /* set tx stop bits count */
        reg |= ((uint32_t)stopbitscount << 1U);
        LINFLEXD_UART_GCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      LINFlexD_UART monitors the idle state of the reception line (API_ID(0x0022U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_idle_receive_line_monitor(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0022U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        /* set monitor idle state */
        reg |= LINFLEXD_UART_UARTCR_MIS;
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      LINFlexD_UART monitors the number of bits to be received (API_ID(0x0023U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_number_receive_bits_monitor(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0023U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        /* set monitor idle state */
        reg &= ~(LINFLEXD_UART_UARTCR_MIS);
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      set LINFlexD_UART reset mode of the timeout counter (API_ID(0x0024U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  mode: timeout counter reset mode
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_TIMEOUT_SW_HANDLE: Timeout must be handled by software
      \arg        LINFLEXD_UART_TIMEOUT_DISABLE_AFTER_FRAMES: Timeout is disabled after receiving the configured number of data frames
    \param[out] none
    \retval     none
*/
void linflexd_uart_timeout_resetmode_set(uint32_t linflexd_uart_periph, linflexd_uart_timeout_control_enum mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0024U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_UARTCR_DTU);
        /* set timeout reset mode */
        reg |= ((uint32_t)mode << 19U);
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      set LINFlexD_UART value of the timeout counter (API_ID(0x0025U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  value: timeout counter value
    \param[out] none
    \retval     none
*/
void linflexd_uart_idle_timeoutvalue_set(uint32_t linflexd_uart_periph, uint32_t value)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0025U), ERR_PERIPH);
    } else if(NOT_LINFLEXD_UART_TIMEOUT_VALUE(value)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0025U), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTPTO(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_UARTPTO_PTO);
        /* set idle timeout value */
        reg |= value;
        LINFLEXD_UART_UARTPTO(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      enable LINFlexD_UART special word length mode (API_ID(0x0026U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_specialwordlength_enable(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0026U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        /* enter special word length mode */
        reg |= LINFLEXD_UART_UARTCR_WLS;
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      disable LINFlexD_UART special word length mode (API_ID(0x0027U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_specialwordlength_disable(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0027U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        /* exit special word length mode */
        reg &= ~(LINFLEXD_UART_UARTCR_WLS);
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      set LINFlexD_UART number of expected frame (API_ID(0x0028U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  framecount: number of expected frames
    \param[out] none
    \retval     none
*/
void linflexd_uart_expect_framenumber_set(uint32_t linflexd_uart_periph, uint8_t framecount)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0028U), ERR_PERIPH);
    } else if(NOT_LINFLEXD_UART_EXPECTED_FRAME_COUNT(framecount)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0028U), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t reg;

