sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_uart.c
        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_UARTCR_NEF);
        /* set number of expected frames */
        reg |= ((uint32_t)framecount << 20U);
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      enable LINFlexD_UART reduced oversampling (API_ID(0x0029U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_reducedoversampling_enable(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0029U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        /* enter reduced oversampling mode */
        reg |= LINFLEXD_UART_UARTCR_ROSE;
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      disable LINFlexD_UART reduced oversampling (API_ID(0x002AU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_reducedoversampling_disable(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x002AU), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        /* exit reduced oversampling mode */
        reg &= ~(LINFLEXD_UART_UARTCR_ROSE);
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      set LINFlexD_UART over sampling rate (API_ID(0x002BU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  osrcount: number of over sampling rate, for proper functionality, only can take values 4, 5, 6, and 8
    \param[out] none
    \retval     none
*/
void linflexd_uart_oversamplingrate_set(uint32_t linflexd_uart_periph, uint8_t osrcount)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x002BU), ERR_PERIPH);
    } else if(NOT_LINFLEXD_UART_OSRCOUNT(osrcount)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x002BU), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_UARTCR_OSR);
        /* set over sampling rate */
        reg |= ((uint32_t)osrcount << 24U);
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      set LINFlexD_UART configurable sample points (API_ID(0x002CU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  cspcount: number of configurable sample points, only can take values 2, 3, 4, and 5
    \param[out] none
    \retval     none
*/
void linflexd_uart_samplepoint_set(uint32_t linflexd_uart_periph, uint8_t cspcount)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x002CU), ERR_PERIPH);
    } else if(NOT_LINFLEXD_UART_CSPCOUNT(cspcount)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x002CU), ERR_PARAM_INVALID);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_UARTCR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_UARTCR_CSP);
        /* set configurable sample points */
        reg |= ((uint32_t)cspcount << 28U);
        LINFLEXD_UART_UARTCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      config LINFlexD_UART transmit data first bit MSB (API_ID(0x002DU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  mode: transmit data first bit mode
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_DATAFIRST_MSB: MSB first
      \arg        LINFLEXD_UART_DATAFIRST_LSB: LSB first
    \param[out] none
    \retval     none
*/
void linflexd_uart_transmit_datafirst_config(uint32_t linflexd_uart_periph, linflexd_uart_datafirst_enum mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x002DU), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_GCR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_GCR_TDFBM);
        /* set transmitter data first bit */
        reg |= ((uint32_t)mode << 5U);
        LINFLEXD_UART_GCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      config LINFlexD_UART received data first bit MSB (API_ID(0x002EU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  mode: received data first bit mode
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_DATAFIRST_MSB: MSB first
      \arg        LINFLEXD_UART_DATAFIRST_LSB: LSB first
    \param[out] none
    \retval     none
*/
void linflexd_uart_receive_datafirst_config(uint32_t linflexd_uart_periph, linflexd_uart_datafirst_enum mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x002EU), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_GCR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_GCR_RDFBM);
        /* set receiver data first bit */
        reg |= ((uint32_t)mode << 4U);
        LINFLEXD_UART_GCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      config LINFlexD_UART transmit data invert (API_ID(0x002FU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  mode: transmit invert mode
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_TXRX_INVERT_DISABLE: TX/RX data/pin level not inversion
      \arg        LINFLEXD_UART_TXRX_INVERT_ENABLE: TX/RX data/pin level inversion
    \param[out] none
    \retval     none
*/
void linflexd_uart_transmitdata_invert_config(uint32_t linflexd_uart_periph, linflexd_uart_txrx_invert_enum mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x002FU), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_GCR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_GCR_TDLIS);
        /* set transmit data invert */
        reg |= ((uint32_t)mode << 3U);
        LINFLEXD_UART_GCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      config LINFlexD_UART receive data invert (API_ID(0x0030U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  mode: receive invert mode
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_TXRX_INVERT_DISABLE: TX/RX data/pin level not inversion
      \arg        LINFLEXD_UART_TXRX_INVERT_ENABLE: TX/RX data/pin level inversion
    \param[out] none
    \retval     none
*/
void linflexd_uart_receivedata_invert_config(uint32_t linflexd_uart_periph, linflexd_uart_txrx_invert_enum mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0030U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_GCR(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_GCR_RDLIS);
        /* set receive data invert */
        reg |= ((uint32_t)mode << 2U);
        LINFLEXD_UART_GCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      config LINFlexD_UART transmit pin invert (API_ID(0x0031U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  mode: transmit invert mode
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_TXRX_INVERT_DISABLE: TX/RX data/pin level not inversion
      \arg        LINFLEXD_UART_TXRX_INVERT_ENABLE: TX/RX data/pin level inversion
    \param[out] none
    \retval     none
*/
void linflexd_uart_transmitpin_invert_config(uint32_t linflexd_uart_periph, linflexd_uart_txrx_invert_enum mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0031U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_LIN_STCTL(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_LIN_STCTL_TX_INV);
        /* set transmit pin invert */
        reg |= ((uint32_t)mode << 4U);
        LINFLEXD_UART_LIN_STCTL(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      config LINFlexD_UART receive pin invert (API_ID(0x0032U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  mode: receive invert mode
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_TXRX_INVERT_DISABLE: TX/RX data/pin level not inversion
      \arg        LINFLEXD_UART_TXRX_INVERT_ENABLE: TX/RX data/pin level inversion
    \param[out] none
    \retval     none
*/
void linflexd_uart_receivepin_invert_config(uint32_t linflexd_uart_periph, linflexd_uart_txrx_invert_enum mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0032U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_LIN_STCTL(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_LIN_STCTL_RX_INV);
        /* set receive pin invert */
        reg |= ((uint32_t)mode << 5U);
        LINFLEXD_UART_LIN_STCTL(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      LINFlexD_UART soft reset (API_ID(0x0033U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_soft_reset(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0033U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_GCR(linflexd_uart_periph);
        /* set soft reset */
        reg |= LINFLEXD_UART_GCR_SR;
        LINFLEXD_UART_GCR(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      LINFlexD_UART abort the current transmission (API_ID(0x0034U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_abort_request(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0034U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

