sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_uart.c
        reg = LINFLEXD_UART_LINCR2(linflexd_uart_periph);
        /* set abort request */
        reg |= LINFLEXD_UART_LINCR2_ABRQ;
        LINFLEXD_UART_LINCR2(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      enable or disable LINFlexD_UART terminate the transmission (API_ID(0x0035U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  mode: ENABLE/DISABLE
    \param[out] none
    \retval     none
*/
void linflexd_uart_terminate_transmit(uint32_t linflexd_uart_periph, ControlStatus mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0035U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_LIN_STCTL(linflexd_uart_periph);
        reg &= ~LINFLEXD_UART_LIN_STCTL_STOP;
        /* set stop bit */
        reg |= (uint32_t)mode;
        LINFLEXD_UART_LIN_STCTL(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      LINFlexD_UART stop state get (API_ID(0x0036U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus linflexd_uart_stop_get(uint32_t linflexd_uart_periph)
{
    FlagStatus stopstate = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0036U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_LIN_STCTL(linflexd_uart_periph);
        /* check stop ack bit */
        stopstate = ((reg & LINFLEXD_UART_LIN_STCTL_ACK) != 0x0U) ? SET : RESET;
    }
    return stopstate;
}

/*!
    \brief      LINFlexD_UART transmit the tx data by byte (API_ID(0x0037U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  data: data byte
    \param[out] none
    \retval     none
*/
void linflexd_uart_byte_transmit(uint32_t linflexd_uart_periph, uint8_t data)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0037U), ERR_PERIPH);
    } else
#endif
    {
        LINFLEXD_UART_BDRL(linflexd_uart_periph) = data;
    }
}

/*!
    \brief      LINFlexD_UART transmit the tx data by halfword (API_ID(0x0038U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  data: data half-word
    \param[out] none
    \retval     none
*/
void linflexd_uart_halfword_transmit(uint32_t linflexd_uart_periph, uint16_t data)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0038U), ERR_PERIPH);
    } else
#endif
    {
        LINFLEXD_UART_BDRL(linflexd_uart_periph) = data;
    }
}

/*!
    \brief      LINFlexD_UART receive the rx data by byte (API_ID(0x0039U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     data: data byte
*/
uint8_t linflexd_uart_byte_receive(uint32_t linflexd_uart_periph)
{
    uint8_t data = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0039U), ERR_PERIPH);
    } else
#endif
    {
        data = (uint8_t)LINFLEXD_UART_BDRM(linflexd_uart_periph);
    }
    return data;
}

/*!
    \brief      LINFlexD_UART receive the rx data by halfword (API_ID(0x003AU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     data: data half-word
*/
uint16_t linflexd_uart_halfword_receive(uint32_t linflexd_uart_periph)
{
    uint16_t data = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x003AU), ERR_PERIPH);
    } else
#endif
    {
        data = (uint16_t)LINFLEXD_UART_BDRM(linflexd_uart_periph);
    }
    return data;
}

/*!
    \brief      enable LINFlexD_UART tx dma channel (API_ID(0x003BU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_tx_dma_enable(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x003BU), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_DMATXE(linflexd_uart_periph);
        reg |= LINFLEXD_UART_DMATXE_DTE0;
        LINFLEXD_UART_DMATXE(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      disable LINFlexD_UART tx dma channel (API_ID(0x003CU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_tx_dma_disable(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x003CU), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_DMATXE(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_DMATXE_DTE0);
        LINFLEXD_UART_DMATXE(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      enable LINFlexD_UART rx dma channel (API_ID(0x003DU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_rx_dma_enable(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x003DU), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_DMARXE(linflexd_uart_periph);
        reg |= LINFLEXD_UART_DMARXE_DRE0;
        LINFLEXD_UART_DMARXE(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      disable LINFlexD_UART rx dma channel (API_ID(0x003EU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[out] none
    \retval     none
*/
void linflexd_uart_rx_dma_disable(uint32_t linflexd_uart_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x003EU), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_DMARXE(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_DMARXE_DRE0);
        LINFLEXD_UART_DMARXE(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      set LINFlexD_UART byte size for transmission on the IPS bus (API_ID(0x003FU))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  size: ips size type
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_IPS_DATA_WORD: 4 bytes
      \arg        LINFLEXD_UART_IPS_DATA_BYTE: 1 byte
      \arg        LINFLEXD_UART_IPS_DATA_HALFWORD: 2 bytes
    \param[out] none
    \retval     none
*/
void linflexd_uart_ips_size_set(uint32_t linflexd_uart_periph, linflexd_uart_ips_sizetype_enum size)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x003FU), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;

        reg = LINFLEXD_UART_LIN_STCTL(linflexd_uart_periph);
        reg &= ~(LINFLEXD_UART_LIN_STCTL_SIZE);
        reg |= ((uint32_t)size << 2U);
        LINFLEXD_UART_LIN_STCTL(linflexd_uart_periph) = reg;
    }
}

/*!
    \brief      return LINFlexD_UART flag (API_ID(0x0040U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  flag: linflexd_uart status flag
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_FLAG_NF: noise flag
      \arg        LINFLEXD_UART_FLAG_DTF_TFF: data transmission completed flag/ Tx FIFO full flag
      \arg        LINFLEXD_UART_FLAG_DRF_RFE: data reception completed flag / Rx FIFO empty flag
      \arg        LINFLEXD_UART_FLAG_TO: timeout flag
      \arg        LINFLEXD_UART_FLAG_RFNE: receive FIFO not empty flag
      \arg        LINFLEXD_UART_FLAG_WUF: wakeup flag
      \arg        LINFLEXD_UART_FLAG_RDI: receiver input state flag
      \arg        LINFLEXD_UART_FLAG_BOF: FIFO / buffer overrun flag
      \arg        LINFLEXD_UART_FLAG_FEF: frame error flag
      \arg        LINFLEXD_UART_FLAG_RMB: release message buffer flag
      \arg        LINFLEXD_UART_FLAG_PE0: parity error 0 flag
      \arg        LINFLEXD_UART_FLAG_PE1: parity error 1 flag
      \arg        LINFLEXD_UART_FLAG_PE2: parity error 2 flag
      \arg        LINFLEXD_UART_FLAG_PE3: parity error 3 flag
      \arg        LINFLEXD_UART_FLAG_OCF: output compare flag
      \arg        LINFLEXD_UART_FLAG_SZF: stuck at zero flag
    \param[out] none
    \retval     SET - UART status flag set, RESET - UART status flag reset
*/
FlagStatus linflexd_uart_flag_get(uint32_t linflexd_uart_periph, linflexd_uart_flag_enum flag)
{
    FlagStatus status = RESET;

