sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_uart.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0040U), ERR_PERIPH);
    } else
#endif
    {
        if(0U != (LINFLEXD_UART_REG_VAL(linflexd_uart_periph, flag) & BIT(LINFLEXD_UART_BIT_POS(flag)))) {
            status = SET;
        } else {
            status = RESET;
        }
    }
    return status;
}

/*!
    \brief      clear LINFlexD_UART interrupt flag (API_ID(0x0041U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  flag: linflexd_uart status flag
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_FLAG_NF: noise flag
      \arg        LINFLEXD_UART_FLAG_DTF_TFF: data transmission completed flag/ Tx FIFO full flag
      \arg        LINFLEXD_UART_FLAG_DRF_RFE: data reception completed flag / Rx FIFO empty flag
      \arg        LINFLEXD_UART_FLAG_TO: timeout flag
      \arg        LINFLEXD_UART_FLAG_RFNE: receive FIFO not empty flag
      \arg        LINFLEXD_UART_FLAG_WUF: wakeup flag
      \arg        LINFLEXD_UART_FLAG_RDI: receiver input state flag
      \arg        LINFLEXD_UART_FLAG_BOF: FIFO / buffer overrun flag
      \arg        LINFLEXD_UART_FLAG_FEF: frame error flag
      \arg        LINFLEXD_UART_FLAG_RMB: release message buffer flag
      \arg        LINFLEXD_UART_FLAG_PE0: parity error 0 flag
      \arg        LINFLEXD_UART_FLAG_PE1: parity error 1 flag
      \arg        LINFLEXD_UART_FLAG_PE2: parity error 2 flag
      \arg        LINFLEXD_UART_FLAG_PE3: parity error 3 flag
      \arg        LINFLEXD_UART_FLAG_OCF: output compare flag
      \arg        LINFLEXD_UART_FLAG_SZF: stuck at zero flag
    \param[out] none
    \retval     none
*/
void linflexd_uart_flag_clear(uint32_t linflexd_uart_periph, linflexd_uart_flag_enum flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0041U), ERR_PERIPH);
    } else
#endif
    {
        LINFLEXD_UART_UARTSR(linflexd_uart_periph) |= BIT(LINFLEXD_UART_BIT_POS(flag));
    }
}

/*!
    \brief      enable LINFlexD_UART interrupt (API_ID(0x0042U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  interrupt: linflexd_uart interrupt source
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_INT_DTF: data transmitted interrupt
      \arg        LINFLEXD_UART_INT_DRF: data reception complete interrupt
      \arg        LINFLEXD_UART_INT_TO: timeout interrupt
      \arg        LINFLEXD_UART_INT_WUF: wakeup interrupt
      \arg        LINFLEXD_UART_INT_BOF: buffer overrun interrupt
      \arg        LINFLEXD_UART_INT_FEF: frame error interrupt
      \arg        LINFLEXD_UART_INT_OCF: output compare interrupt
      \arg        LINFLEXD_UART_INT_SZF: stuck at zero interrupt
    \param[out] none
    \retval     none
*/
void linflexd_uart_interrupt_enable(uint32_t linflexd_uart_periph, linflexd_uart_interrupt_enum interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0042U), ERR_PERIPH);
    } else
#endif
    {
        LINFLEXD_UART_REG_VAL(linflexd_uart_periph, interrupt) |= BIT(LINFLEXD_UART_BIT_POS(interrupt));
    }
}

/*!
    \brief      disable LINFlexD_UART interrupt (API_ID(0x0043U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  interrupt: linflexd_uart interrupt source
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_INT_DTF: data transmitted interrupt
      \arg        LINFLEXD_UART_INT_DRF: data reception complete interrupt
      \arg        LINFLEXD_UART_INT_TO: timeout interrupt
      \arg        LINFLEXD_UART_INT_WUF: wakeup interrupt
      \arg        LINFLEXD_UART_INT_BOF: buffer overrun interrupt
      \arg        LINFLEXD_UART_INT_FEF: frame error interrupt
      \arg        LINFLEXD_UART_INT_OCF: output compare interrupt
      \arg        LINFLEXD_UART_INT_SZF: stuck at zero interrupt
    \param[out] none
    \retval     none
*/
void linflexd_uart_interrupt_disable(uint32_t linflexd_uart_periph, linflexd_uart_interrupt_enum interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0043U), ERR_PERIPH);
    } else
#endif
    {
        LINFLEXD_UART_REG_VAL(linflexd_uart_periph, interrupt) &= ~BIT(LINFLEXD_UART_BIT_POS(interrupt));
    }
}

/*!
    \brief      get LINFlexD_UART interrupt flag (API_ID(0x0044U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  int_flag: linflexd_uart interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_INT_FLAG_DTF: data transmission completed interrupt and flag
      \arg        LINFLEXD_UART_INT_FLAG_DRF: data reception completed interrupt and flag
      \arg        LINFLEXD_UART_INT_FLAG_TO: timeout interrupt and flag
      \arg        LINFLEXD_UART_INT_FLAG_WU: wakeup interrupt and flag
      \arg        LINFLEXD_UART_INT_FLAG_BOF: buffer overrun interrupt and flag
      \arg        LINFLEXD_UART_INT_FLAG_FEF: framing error interrupt and flag
      \arg        LINFLEXD_UART_INT_FLAG_OCF: output compare interrupt and flag
      \arg        LINFLEXD_UART_INT_FLAG_SZF: stuck at zero interrupt and flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus linflexd_uart_interrupt_flag_get(uint32_t linflexd_uart_periph, linflexd_uart_interrupt_flag_enum int_flag)
{
    FlagStatus status = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0044U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t intenable, flagstatus;
        /* get the interrupt enable bit status */
        intenable = (LINFLEXD_UART_REG_VAL(linflexd_uart_periph, int_flag) & BIT(LINFLEXD_UART_BIT_POS(int_flag)));
        /* get the corresponding flag bit status */
        flagstatus = (LINFLEXD_UART_REG_VAL2(linflexd_uart_periph, int_flag) & BIT(LINFLEXD_UART_BIT_POS2(int_flag)));

        if((0U != flagstatus) && (0U != intenable)) {
            status = SET;
        } else {
            status = RESET;
        }
    }
    return status;
}

/*!
    \brief      clear LINFlexD_UART interrupt flag (API_ID(0x0045U))
    \param[in]  linflexd_uart_periph: LINFLEXD_UARTx(x=0,1,...,11)
    \param[in]  int_flag: linflexd_uart interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_UART_INT_FLAG_DTF: data transmission completed interrupt and flag
      \arg        LINFLEXD_UART_INT_FLAG_DRF: data reception completed interrupt and flag
      \arg        LINFLEXD_UART_INT_FLAG_TO: timeout interrupt and flag
      \arg        LINFLEXD_UART_INT_FLAG_WUF: wakeup interrupt and flag
      \arg        LINFLEXD_UART_INT_FLAG_BOF: buffer overrun interrupt and flag
      \arg        LINFLEXD_UART_INT_FLAG_FEF: framing error interrupt and flag
      \arg        LINFLEXD_UART_INT_FLAG_OCF: output compare interrupt and flag
      \arg        LINFLEXD_UART_INT_FLAG_SZF: stuck at zero interrupt and flag
    \param[out] none
    \retval     none
*/
void linflexd_uart_interrupt_flag_clear(uint32_t linflexd_uart_periph, linflexd_uart_interrupt_flag_enum int_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_UART_PERIPH(linflexd_uart_periph)) {
        fw_debug_report_err(LINFLEXD_UART_MODULE_ID, API_ID(0x0045U), ERR_PERIPH);
    } else
#endif
    {
       LINFLEXD_UART_UARTSR(linflexd_uart_periph) |= BIT(LINFLEXD_UART_BIT_POS2(int_flag));
    }
}
